# 引入工具包

In [60]:
import pandas as pd
import lightgbm as lgb

# 函数

## 输出最大值 最小值 中位数 平均值 分位数值

In [49]:
def load_data(file_name, converters):
    data_df = pd.read_csv(file_name, converters=converters)
    return data_df

In [ ]:
# df  : dataframe
# col : list, dataframe columns name
def base_numpy_fea_info(df, col):
    pass

# 载入训练集

In [20]:
raw_data_train = pd.read_csv('../../raw data/train.csv')

In [21]:
raw_data_train.shape

(800000, 47)

In [22]:
raw_data_train.columns

Index(['id', 'loanAmnt', 'term', 'interestRate', 'installment', 'grade',
       'subGrade', 'employmentTitle', 'employmentLength', 'homeOwnership',
       'annualIncome', 'verificationStatus', 'issueDate', 'isDefault',
       'purpose', 'postCode', 'regionCode', 'dti', 'delinquency_2years',
       'ficoRangeLow', 'ficoRangeHigh', 'openAcc', 'pubRec',
       'pubRecBankruptcies', 'revolBal', 'revolUtil', 'totalAcc',
       'initialListStatus', 'applicationType', 'earliesCreditLine', 'title',
       'policyCode', 'n0', 'n1', 'n2', 'n3', 'n4', 'n5', 'n6', 'n7', 'n8',
       'n9', 'n10', 'n11', 'n12', 'n13', 'n14'],
      dtype='object')

## 贷款金额 贷款期限

In [23]:
raw_data_train[['id', 'loanAmnt', 'term']]

            id  loanAmnt  term
0            0   35000.0     5
1            1   18000.0     5
2            2   12000.0     5
3            3   11000.0     3
4            4    3000.0     3
...        ...       ...   ...
799995  799995   25000.0     3
799996  799996   17000.0     3
799997  799997    6000.0     3
799998  799998   19200.0     3
799999  799999    9000.0     3

[800000 rows x 3 columns]

### 最大值 最小值 中位数 平均值 分位数

In [24]:
raw_data_train[['loanAmnt', 'term']].describe()

            loanAmnt           term
count  800000.000000  800000.000000
mean    14416.818875       3.482745
std      8716.086178       0.855832
min       500.000000       3.000000
25%      8000.000000       3.000000
50%     12000.000000       3.000000
75%     20000.000000       3.000000
max     40000.000000       5.000000

## 贷款利率 分期付款金额 贷款等级 贷款等级之子级

In [25]:
raw_data_train[['id', 'interestRate', 'installment', 'grade', 'subGrade']]

            id  interestRate  installment grade subGrade
0            0         19.52       917.97     E       E2
1            1         18.49       461.90     D       D2
2            2         16.99       298.17     D       D3
3            3          7.26       340.96     A       A4
4            4         12.99       101.07     C       C2
...        ...           ...          ...   ...      ...
799995  799995         14.49       860.41     C       C4
799996  799996          7.90       531.94     A       A4
799997  799997         13.33       203.12     C       C3
799998  799998          6.92       592.14     A       A4
799999  799999         11.06       294.91     B       B3

[800000 rows x 5 columns]

In [26]:
raw_data_train[['interestRate', 'installment']].describe()

        interestRate    installment
count  800000.000000  800000.000000
mean       13.238391     437.947723
std         4.765757     261.460393
min         5.310000      15.690000
25%         9.750000     248.450000
50%        12.740000     375.135000
75%        15.990000     580.710000
max        30.990000    1715.420000

## 就业职称 就业年限 借款人在登记时提供的房屋所有权状况 年收入

In [27]:
raw_data_train[['id', 'employmentTitle', 'employmentLength', 'homeOwnership', 'annualIncome']]

            id  employmentTitle employmentLength  homeOwnership  annualIncome
0            0            320.0          2 years              2      110000.0
1            1         219843.0          5 years              0       46000.0
2            2          31698.0          8 years              0       74000.0
3            3          46854.0        10+ years              1      118000.0
4            4             54.0              NaN              1       29000.0
...        ...              ...              ...            ...           ...
799995  799995           2659.0          7 years              1       72000.0
799996  799996          29205.0        10+ years              0       99000.0
799997  799997           2582.0        10+ years              1       65000.0
799998  799998            151.0        10+ years              0       96000.0
799999  799999             13.0          5 years              0      120000.0

[800000 rows x 5 columns]

In [28]:
df_tmp = raw_data_train['employmentLength'].str.split(expand=True)

In [31]:
raw_data_train['employmentLength'] = df_tmp[0]

In [33]:
raw_data_train['employmentLength'].fillna(-1, inplace=True)

In [35]:
raw_data_train[['id', 'employmentTitle', 'employmentLength', 'homeOwnership', 'annualIncome']]

            id  employmentTitle employmentLength  homeOwnership  annualIncome
0            0            320.0                2              2      110000.0
1            1         219843.0                5              0       46000.0
2            2          31698.0                8              0       74000.0
3            3          46854.0              10+              1      118000.0
4            4             54.0               -1              1       29000.0
...        ...              ...              ...            ...           ...
799995  799995           2659.0                7              1       72000.0
799996  799996          29205.0              10+              0       99000.0
799997  799997           2582.0              10+              1       65000.0
799998  799998            151.0              10+              0       96000.0
799999  799999             13.0                5              0      120000.0

[800000 rows x 5 columns]

In [36]:
raw_data_train[['employmentTitle', 'employmentLength', 'homeOwnership', 'annualIncome']].describe()

       employmentTitle  homeOwnership  annualIncome
count    799999.000000  800000.000000  8.000000e+05
mean      72005.351714       0.614213  7.613391e+04
std      106585.640204       0.675749  6.894751e+04
min           0.000000       0.000000  0.000000e+00
25%         427.000000       0.000000  4.560000e+04
50%        7755.000000       1.000000  6.500000e+04
75%      117663.500000       1.000000  9.000000e+04
max      378351.000000       5.000000  1.099920e+07

## 验证状态 贷款发放的月份 贷款用途类别

In [38]:
raw_data_train[['id', 'verificationStatus', 'issueDate', 'purpose']]

            id  verificationStatus   issueDate  purpose
0            0                   2  2014-07-01        1
1            1                   2  2012-08-01        0
2            2                   2  2015-10-01        0
3            3                   1  2015-08-01        4
4            4                   2  2016-03-01       10
...        ...                 ...         ...      ...
799995  799995                   0  2016-07-01        0
799996  799996                   2  2013-04-01        4
799997  799997                   2  2015-10-01        0
799998  799998                   2  2015-02-01        4
799999  799999                   0  2018-08-01        4

[800000 rows x 4 columns]

## 邮政编码 地区编码

In [39]:
# postCode int or string
raw_data_train[['id', 'postCode', 'regionCode']]

            id  postCode  regionCode
0            0     137.0          32
1            1     156.0          18
2            2     337.0          14
3            3     148.0          11
4            4     301.0          21
...        ...       ...         ...
799995  799995     242.0           8
799996  799996     563.0          10
799997  799997      47.0          17
799998  799998      34.0          18
799999  799999      62.0          13

[800000 rows x 3 columns]

## 债务收入比 多种违约记录

In [41]:
raw_data_train[['id', 'dti', 'delinquency_2years', 'ficoRangeLow', 'ficoRangeHigh', 'openAcc', 'pubRec', 'pubRecBankruptcies']]

,id,dti,delinquency_2years,ficoRangeLow,ficoRangeHigh,openAcc,pubRec,pubRecBankruptcies
0,0,17.05,0.0,730.0,734.0,7.0,0.0,0.0
1,1,27.83,0.0,700.0,704.0,13.0,0.0,0.0
2,2,22.77,0.0,675.0,679.0,11.0,0.0,0.0
3,3,17.21,0.0,685.0,689.0,9.0,0.0,0.0
4,4,32.16,0.0,690.0,694.0,12.0,0.0,0.0
...,...,...,...,...,...,...,...,...
799995,799995,19.03,0.0,710.0,714.0,14.0,0.0,0.0
799996,799996,15.72,1.0,720.0,724.0,7.0,0.0,0.0
799997,799997,12.11,1.0,670.0,674.0,5.0,0.0,0.0
799998,799998,29.25,0.0,675.0,679.0,16.0,0.0,0.0
799999,799999,8.99,0.0,695.0,699.0,7.0,0.0,0.0

In [42]:
raw_data_train[['dti', 'delinquency_2years', 'ficoRangeLow', 'ficoRangeHigh', 'openAcc', 'pubRec', 'pubRecBankruptcies']].describe()

,dti,delinquency_2years,ficoRangeLow,ficoRangeHigh,openAcc,pubRec,pubRecBankruptcies
count,799761.000000,800000.000000,800000.000000,800000.000000,800000.000000,800000.000000,799595.000000
mean,18.284557,0.318239,696.204081,700.204226,11.598020,0.214915,0.134163
std,11.150155,0.880325,31.865995,31.866674,5.475286,0.606467,0.377471
min,-1.000000,0.000000,630.000000,634.000000,0.000000,0.000000,0.000000
25%,11.790000,0.000000,670.000000,674.000000,8.000000,0.000000,0.000000
50%,17.610000,0.000000,690.000000,694.000000,11.000000,0.000000,0.000000
75%,24.060000,0.000000,710.000000,714.000000,14.000000,0.000000,0.000000
max,999.000000,39.000000,845.000000,850.000000,86.000000,86.000000,12.000000

## 信贷周转余额合计 循环额度利用率 借款人信用额度总数

In [44]:
raw_data_train[['id', 'revolBal', 'revolUtil', 'totalAcc']]

            id  revolBal  revolUtil  totalAcc
0            0   24178.0       48.9      27.0
1            1   15096.0       38.9      18.0
2            2    4606.0       51.8      27.0
3            3    9948.0       52.6      28.0
4            4    2942.0       32.0      27.0
...        ...       ...        ...       ...
799995  799995    9933.0       46.4      15.0
799996  799996   20472.0       98.4      42.0
799997  799997    6381.0       51.9      36.0
799998  799998   69702.0       61.3      37.0
799999  799999    8420.0       72.6      13.0

[800000 rows x 4 columns]

In [45]:
raw_data_train[['revolBal', 'revolUtil', 'totalAcc']].describe()

           revolBal      revolUtil       totalAcc
count  8.000000e+05  799469.000000  800000.000000
mean   1.622871e+04      51.790734      24.998861
std    2.245802e+04      24.516126      11.999201
min    0.000000e+00       0.000000       2.000000
25%    5.944000e+03      33.400000      16.000000
50%    1.113200e+04      52.100000      23.000000
75%    1.973400e+04      70.700000      32.000000
max    2.904836e+06     892.300000     162.000000

## 贷款初始列表状态 是否联合申请 信用额度开立月份 借款人贷款名称 公开策略代码

In [46]:
raw_data_train[['id', 'initialListStatus', 'applicationType', 'earliesCreditLine', 'title', 'policyCode']]

,id,initialListStatus,applicationType,earliesCreditLine,title,policyCode
0,0,0,0,Aug-2001,1.0,1.0
1,1,1,0,May-2002,1723.0,1.0
2,2,0,0,May-2006,0.0,1.0
3,3,1,0,May-1999,4.0,1.0
4,4,0,0,Aug-1977,11.0,1.0
...,...,...,...,...,...,...
799995,799995,1,0,Aug-2011,0.0,1.0
799996,799996,0,0,May-1989,33369.0,1.0
799997,799997,1,0,Jul-2002,0.0,1.0
799998,799998,1,0,Jan-1994,4.0,1.0
799999,799999,0,0,Feb-2002,4.0,1.0

## 匿名特征

In [48]:
raw_data_train[['id', 'n0', 'n1', 'n2', 'n3', 'n4', 'n5', 'n6', 'n7', 'n8',
       'n9', 'n10', 'n11', 'n12', 'n13', 'n14']]

,id,n0,n1,n2,n3,n4,n5,n6,n7,n8,n9,n10,n11,n12,n13,n14
0,0,0.0,2.0,2.0,2.0,4.0,9.0,8.0,4.0,12.0,2.0,7.0,0.0,0.0,0.0,2.0
1,1,NaN,NaN,NaN,NaN,10.0,NaN,NaN,NaN,NaN,NaN,13.0,NaN,NaN,NaN,NaN
2,2,0.0,0.0,3.0,3.0,0.0,0.0,21.0,4.0,5.0,3.0,11.0,0.0,0.0,0.0,4.0
3,3,6.0,4.0,6.0,6.0,4.0,16.0,4.0,7.0,21.0,6.0,9.0,0.0,0.0,0.0,1.0
4,4,1.0,2.0,7.0,7.0,2.0,4.0,9.0,10.0,15.0,7.0,12.0,0.0,0.0,0.0,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
799995,799995,0.0,5.0,10.0,10.0,6.0,6.0,2.0,12.0,13.0,10.0,14.0,0.0,0.0,0.0,3.0
799996,799996,0.0,2.0,2.0,2.0,2.0,15.0,16.0,2.0,19.0,2.0,7.0,0.0,0.0,0.0,0.0
799997,799997,2.0,1.0,4.0,4.0,1.0,4.0,26.0,4.0,10.0,4.0,5.0,0.0,0.0,1.0,4.0
799998,799998,0.0,5.0,8.0,8.0,7.0,10.0,6.0,12.0,22.0,8.0,16.0,0.0,0.0,0.0,5.0
799999,799999,2.0,2.0,3.0,3.0,2.0,3.0,4.0,4.0,8.0,3.0,7.0,0.0,0.0,0.0,2.0

# 读取数据

In [57]:
converters = {'id': str, 'term': int, 'grade': str, 'subGrade': str, 'employmentTitle': str, 'employmentLength': str,
              'homeOwnership': str, 'verificationStatus': str, 'purpose': str, 'postCode': str, 'regionCode': str,
              'initialListStatus': str, 'applicationType': str, 'title': str, 'policyCode': str}

In [58]:
raw_data = load_data(file_name='../../raw data/train.csv', converters=converters)

In [59]:
raw_data

,id,loanAmnt,term,interestRate,installment,grade,subGrade,employmentTitle,employmentLength,homeOwnership,...,n5,n6,n7,n8,n9,n10,n11,n12,n13,n14
0,0,35000.0,5,19.52,917.97,E,E2,320.0,2 years,2,...,9.0,8.0,4.0,12.0,2.0,7.0,0.0,0.0,0.0,2.0
1,1,18000.0,5,18.49,461.90,D,D2,219843.0,5 years,0,...,NaN,NaN,NaN,NaN,NaN,13.0,NaN,NaN,NaN,NaN
2,2,12000.0,5,16.99,298.17,D,D3,31698.0,8 years,0,...,0.0,21.0,4.0,5.0,3.0,11.0,0.0,0.0,0.0,4.0
3,3,11000.0,3,7.26,340.96,A,A4,46854.0,10+ years,1,...,16.0,4.0,7.0,21.0,6.0,9.0,0.0,0.0,0.0,1.0
4,4,3000.0,3,12.99,101.07,C,C2,54.0,,1,...,4.0,9.0,10.0,15.0,7.0,12.0,0.0,0.0,0.0,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
799995,799995,25000.0,3,14.49,860.41,C,C4,2659.0,7 years,1,...,6.0,2.0,12.0,13.0,10.0,14.0,0.0,0.0,0.0,3.0
799996,799996,17000.0,3,7.90,531.94,A,A4,29205.0,10+ years,0,...,15.0,16.0,2.0,19.0,2.0,7.0,0.0,0.0,0.0,0.0
799997,799997,6000.0,3,13.33,203.12,C,C3,2582.0,10+ years,1,...,4.0,26.0,4.0,10.0,4.0,5.0,0.0,0.0,1.0,4.0
799998,799998,19200.0,3,6.92,592.14,A,A4,151.0,10+ years,0,...,10.0,6.0,12.0,22.0,8.0,16.0,0.0,0.0,0.0,5.0
799999,799999,9000.0,3,11.06,294.91,B,B3,13.0,5 years,0,...,3.0,4.0,4.0,8.0,3.0,7.0,0.0,0.0,0.0,2.0

# 训练

In [ ]:
lgb_params = {
    'boosting_type': 'gbdt',
    'objective': 'binary',
    'num_leaves': 30,
    'num_round': 360,
    'max_depth':8,
    'learning_rate': 0.01,
    'feature_fraction': 0.5,
    'bagging_fraction': 0.8,
    'bagging_freq': 12
}

clf = lgb.LGBMClassifier(lgb_params)

features = ['loanAmnt', 'term', 'interestRate', 'installment', 'grade',
       'subGrade', 'employmentTitle', 'homeOwnership',
       'annualIncome', 'verificationStatus', 'issueDate', 'isDefault',
       'purpose', 'postCode', 'regionCode', 'dti', 'delinquency_2years',
       'ficoRangeLow', 'ficoRangeHigh', 'openAcc', 'pubRec',
       'pubRecBankruptcies', 'revolBal', 'revolUtil', 'totalAcc',
       'initialListStatus', 'applicationType', 'earliesCreditLine', 'title',
       'policyCode', 'n0', 'n1', 'n2', 'n3', 'n4', 'n5', 'n6', 'n7', 'n8',
       'n9', 'n10', 'n11', 'n12', 'n13', 'n14']

# load data
X, y = raw_data[features], raw_data['isDefault']
lgb.fit

# 预测